/*
 Localization.strings
 KontaktSDK
 */

/* Error Descriptions */
"device_connection_connect_timeout"                                     = "connect timeout";
"device_connection_timeout_while_evaluating_gatt"                       = "timeout while evaluating gatt";
"device_connection_timeout_while_waiting_for_dfu_reconnect"             = "timeout while waiting for dfu reconnect";
"device_connection_connect_failed"                                      = "connect failed";
"device_connection_dfu_legacy_cancelled"                                = "dfu legacy cancelled";
"device_connection_dfu_secure_cancelled"                                = "dfu secure cancelled";
"device_connection_firmware_update_invalid_identifiers"                 = "firmware update invalid identifiers";
"device_connection_firmware_update_cancelled"                           = "firmware update cancelled";
"device_connection_disconnected_from_dfu"                               = "disconnected from dfu";
"device_connection_failed_downloading_credentails"                      = "failed downloading credentails";
"device_connection_legacy_authorization_cancelled"                      = "legacy authorization cancelled";
"device_connection_legacy_authorization_password_error"                 = "legacy authorization password error";
"device_connection_legacy_read_configuration_cancelled"                 = "legacy read configuration cancelled";
"device_connection_legacy_write_configuration_cancelled"                = "legacy write configuration cancelled";
"device_connection_legacy_write_configuration_acknowledge_timeout"      = "legacy write configuration acknowledge timeout";
"device_connection_secure_read_configuration_cancelled"                 = "secure read configuration cancelled";
"device_connection_secure_read_configuration_missing_secure_response"   = "secure read configuration missing secure response";
"device_connection_secure_read_configuration_decrypt_timeout"           = "secure read configuration decrypt timeout";
"device_connection_secure_write_configuration_missing_secure_response"  = "secure write configuration missing secure response";
"device_connection_secure_write_configuration_missing_secure_request"   = "secure write configuration missing secure request";
"device_connection_secure_write_configuration_missing_unique_id"        = "secure write configuration missing unique id";
"device_connection_secure_write_configuration_cancelled"                = "secure write configuration cancelled";
"device_connection_secure_write_configuration_acknowledge_timeout"      = "secure write configuration acknowledge timeout";
"device_connection_firmware_not_supported_write_operation"              = "firmware not supported write operation";
"device_connection_firmware_not_supported_read_operation"               = "firmware not supported read operation";
"device_connection_firmware_not_supported_update_operation"             = "firmware not supported update operation";